# CurveNode Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CurveNode Members
CurveNode Class Methods Properties See Also
---
The CurveNode type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | (Inherited from RenderNode.) |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetCurve | Returns the geometric curve object corresponding to the node. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from RenderNode.) |
| LineProperties | Access to the line (pen) properties of the curve being drawn  (Inherited from ModelCurveNode.) |
| NodeName | A readable name of the output node.  (Inherited from RenderNode.) |

# See Also
CurveNode Class
Autodesk.Revit.DB Namespace